Merge pull request #120 from AndrewRedican/week-2026-04-06_6
ESLint Rules and Documentation Improvements
